<div class="row">
    <div class="col-md-8 col-md-offset-2">
        <h3>Уважаемый пользователь!</h3>
        По всем вопросам, связанным с работой в СИУ-портал Росстандарта просьба обращаться в техническую поддержку системы.
        Способы обращения:
        <ul>
            <!--<li>через форму обратной связи (предпочтительно)</li>-->
            <li>письмо на электронную почту support@polylog.ru (предпочтительно)</li>
            <li>по телефону +7 (495) 258-20-45 (доб. 109) или +7 (968) 668-53-00</li>
        </ul>
        При обращении в техническую поддержку обязательно предоставляйте менеджеру следующую информацию:
        <ul>
            <li>ваши ФИО</li>
            <li>телефон для обратной связи</li>
            <li>адрес электронной почты</li>
            <li>тема обращения</li>
            <li>подробное описание проблемы</li>
            <li>файл со скриншотом (снимком экрана) и/или иной информацией, которая поможет менеджеру решить проблему</li>
        </ul>
    </div>
</div>
