<?php

/* @var $this yii\web\View */

$this->title = 'О системе';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="row">
   <div class="col-md-10 col-md-offset-1">
      <p class="lead">
         Система исполнения услуг Росстандартом (СИУ РСТ) предназначена для обеспечения предоставления Росстандартом государственных услуг в электронном виде.
      </p>
      <h4>Основной функционал системы:</h4>
      <ul>
          <li>Прием заявлений на предоставление госуслуг с ЕПГУ;</li>
          <li>Отправка статусов обработки заявлений на ЕПГУ;</li>
          <li>Формирование заявлений на предоставление госуслуг в ручном режиме;</li>
          <li>Обработка заявлений на предоставление госуслуг;</li>
          <li>Мониторинг сроков оказания госуслуг;</li>
          <li>Ведение реестра заявлений и реестра контрагентов;</li>
          <li>Подготовка аналитических отчетов.</li>
      </ul>
   </div>
</div>
