<?php

/* @var $this yii\web\View */

$this->title = 'О системе';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="row">
   <div class="col-md-10 col-md-offset-1">
      <p class="lead">
          Программа АИС «Школа искусств» предназначена для автоматизации учебного процесса в Школе искусств, реализации пользовательского интерфейса и рассчитана на коллективное использование в сети. </p>
      <h4>Основной функционал системы:</h4>
      <ul>
          <li>оперативное предоставление информации родителям, ученикам, преподавателям;</li>
          <li>возможность удаленного доступа к единому банку данных и получения актуальной информации;</li>
          <li>организация эффективной работы преподавателей и сотрудников;</li>
          <li>улучшение качества учебной  и методической работы;</li>
          <li>более эффективное использование помещений и материально-технической базы;</li>
          <li>построение единой информационной среды в рамках учебного процесса. </li>
      </ul>
   </div>
</div>

