<?php

/**
 * Class m210130_154437_add_default_data
 */
class m210130_154437_add_default_data extends \main\BaseMigration
{
    /**
     * {@inheritdoc}
     * @throws \yii\db\Exception
     */
    public function safeUp()
    {
        // dummy employees
        $o = ObjectFactory::create('employees');
        $o->setdata([
            'type' => 'TC',
            'position' => '1000',
            'name' => 'Карташева Наталья Михайловна',
            'surname' => 'Карташева',
            'firstname' => 'Наталья',
            'thirdname' => 'Михайловна',
            'gender' => '2',
            'birthday' => '03-05-1958',
            'address' => 'Москва',
            'snils' => '1234567890',
            'extphone' => '+7 (495) 794-53-32',
            'intphone' => '+7 (495) 794-53-32',
            'mobphone' => '+7 (495) 794-53-32',
            'email' => 'nat_kartasheva@mail.ru',
            'level' => '1000',
            'direction' => [
                '1' => [
                    'activitytype' => '1',
                    'worktype' => '1000',
                    'specialty' => 'Преподаватель',
                    'stake_category' => '4',
                    'stake' => '24000',
                    'department' => '1000,1004',
                ],
            ]
        ]);

        $subject_data = [
            ['Академический вокал', 'Акад.вок.', '', '', ''],
            ['Аккордеон', 'Акк-н', '', '', ''],
            ['Акробатика', 'Акробатика', '', '', ''],
            ['Актерское мастерство', 'Акт.маст', '', '', ''],
            ['Альт', 'Альт', '', '', ''],
            ['Ансамбль духовых инструментов', 'Анс.дух.инстр.', '', '', ''],
            ['Ансамбль народных инструментов', 'Анс.нар.инстр.', '', '', ''],
            ['Ансамбль', 'Анс.', '', '', ''],
            ['Арфа', 'Арфа', '', '', ''],
            ['Архитектурное творчество', 'Арх.тв.', '', '', ''],
            ['Архитектурные стили', 'Арх.ст.', '', '', ''],
            ['Архитектурный рисунок', 'Арх.рис.', '', '', ''],
            ['Балалайка', 'Бал', '', '', ''],
            ['Баллетная гимнастика', 'Бал.гимн', '', '', ''],
            ['Бально-спортивный танец', 'Бал-спорт.тан', '', '', ''],
            ['Баритон', 'Барит', '', '', ''],
            ['Бас гитара', 'Б.гит', '', '', ''],
            ['Баян', 'Баян', '', '', ''],
            ['Беседы об искусстве', 'Беседы об иск-ве', '', '', ''],
            ['Беседы по хореографическому искусству', 'Беседы по хореогр-му иск-ву', '', '', ''],
            ['Блок флейта', 'Бл.фл', '', '', ''],
            ['Брейк-данс', 'Брейк-данс', '', '', ''],
            ['Валторна', 'Валт', '', '', ''],
            ['Веселая арифметика', 'Арифм.', '', '', ''],
            ['Веселые нотки', 'Вес.нотки', '', '', ''],
            ['Виолончель', 'Виол', '', '', ''],
            ['Вокал', 'Вок', '', '', ''],
            ['Вокально-хоровой ансамбль', 'Вок-хор.анс.', '', '', ''],
            ['Вокальный ансамбль', 'Вок.анс.', '', '', ''],
            ['Вокальный эстрадно-джазовый ансамбль', 'Вок.анс.', '', '', ''],
            ['Гармонь', 'Гарм', '', '', ''],
            ['Гимнастика', 'Гим-ка', '', '', ''],
            ['Гитара', 'Гитар', '', '', ''],
            ['Графика', 'Граф.', '', '', ''],
            ['Гусли', 'Гусли', '', '', ''],
            ['Декоративно-прикладное искусство', 'ДПИ', '', '', ''],
            ['Декорирование', 'Декор', '', '', ''],
            ['Детские массовые танцы', 'ДМТ', '', '', ''],
            ['Джазовый ансамбль', 'джаз.анс.', '', '', ''],
            ['Домра', 'Домр', '', '', ''],
            ['Живопись', 'Жив-сь.', '', '', ''],
            ['Импровизация', 'Импр.', '', '', ''],
            ['Историко-бытовой и бальный танец', 'Бальн.тан.', '', '', ''],
            ['История архитектуры', 'Ист.арх.', '', '', ''],
            ['История джаза', 'Ист.дж.', '', '', ''],
            ['История изобразительного искусства', 'Ист.ИЗО', '', '', ''],
            ['История искусств', 'Ист.иск.', '', '', ''],
            ['Кларнет', 'Клар', '', '', ''],
            ['Классический станок', 'Класс.ст.', '', '', ''],
            ['Классический танец', 'Класс.танец', '', '', ''],
            ['Классический экзерсис', 'Кл.Экз', '', '', ''],
            ['Композиционная постановка танца', 'КПТ', '', '', ''],
            ['Композиция (станковая, прикладная)', 'Комп.', '', '', ''],
            ['Композиция', 'Комп', '', '', ''],
            ['Латина соло', 'Латина соло', '', '', ''],
            ['Лепка', 'Лепка', '', '', ''],
            ['Логопедия', 'Лого', '', '', ''],
            ['Логоритмика', 'Логоритмика', '', '', ''],
            ['Макетирование', 'Макет', '', '', ''],
            ['Мастерство актера', 'Маст.акт.', '', '', ''],
            ['Материаловедение', 'Мат.вед.', '', '', ''],
            ['Музыкальная грамота', 'Муз.гр.', '', '', ''],
            ['Музыкальная информатика', 'Муз.инф.', '', '', ''],
            ['Музыкальная литература и слушание музыки', 'Муз.лит.сл.муз.', '', '', ''],
            ['Музыкальная литература', 'Муз.лит.', '', '', ''],
            ['Народная хореография', 'Нар.хореогр.', '', '', ''],
            ['Народно-сценический танец', 'Нар-сц.тан.', '', '', ''],
            ['Народное творчество', 'Нар.тв-во', '', '', ''],
            ['Народный оркестр', 'Нар.орк.', '', '', ''],
            ['Народный характерный танец', 'НХТ', '', '', ''],
            ['Народный хор', 'Нар.хор', '', '', ''],
            ['Натурный рисунок', 'Нат.рис.', '', '', ''],
            ['Орган', 'Орган', '', '', ''],
            ['Оркестр аккордеонистов', 'Орк. аккорд.', '', '', ''],
            ['Оркестр гитаристов', 'орк.гит.', '', '', ''],
            ['Оркестр духовых инструментов', 'дух.орк.', '', '', ''],
            ['Основы ИЗО', 'Осн.ИЗО', '', '', ''],
            ['Основы актерского мастерства', 'Осн.акт.маст.', '', '', ''],
            ['Основы бального танца', 'Основы бальн.танца', '', '', ''],
            ['Основы графики', 'Осн.граф.', '', '', ''],
            ['Основы дирижирования', 'Дир.', '', '', ''],
            ['Основы изобразительного искусства', 'Осн.ИЗО', '', '', ''],
            ['Основы изобразительной грамоты общ', 'ОИГ общ', '', '', ''],
            ['Основы изобразительной грамоты', 'ОИГ', '', '', ''],
            ['Основы импровизации', 'Импр-я', '', '', ''],
            ['Основы народного танца', 'ОНТ', '', '', ''],
            ['Основы русского народного танца', 'ОРНТ', '', '', ''],
            ['Основы сценического мастерства', 'Основы сц.маст-ва', '', '', ''],
            ['Основы хореографии', 'Осн.хореогр.', '', '', ''],
            ['Основы эстрадного танца', 'Основы эстр.танца', '', '', ''],
            ['Партерная гимнастика', 'Парт.гим-ка', '', '', ''],
            ['Пластика', 'Пластика', '', '', ''],
            ['Пластическая, конструктивная лепка', 'ПКЛ', '', '', ''],
            ['Пленэр', 'Пленэр', '', '', ''],
            ['Проект', 'Проект', '', '', ''],
            ['Развитие речи', 'Раз.реч.', '', '', ''],
            ['Разминка', 'Разминка', '', '', ''],
            ['Растяжка', 'Растяжка', '', '', ''],
            ['Рисунок', 'Рис.', '', '', ''],
            ['Ритм гитара', 'Р.гит', '', '', ''],
            ['Ритмика и танец', 'Ритм.тан', '', '', ''],
            ['Ритмика', 'Рит.', '', '', ''],
            ['Ритмическое сольфеджио', 'Ритм.сольф.', '', '', ''],
            ['Саксофон', 'Сакс', '', '', ''],
            ['Саксофон', 'Сакс', '', '', ''],
            ['Сводная репетиция ОРНТ', 'Св.реп.орнт', '', '', ''],
            ['Сводная репетиция фольклорного ансамбля', 'Св.реп.фольк.анс', '', '', ''],
            ['Сводная репетиция хора', 'Св.реп.хор.', '', '', ''],
            ['Сводный струнный ансамбль', 'Св.стр.анс.', '', '', ''],
            ['Скетчинг', 'Скетч.', '', '', ''],
            ['Скрипка', 'Скр', '', '', ''],
            ['Скульптура', 'Скульпт.', '', '', ''],
            ['Слушание музыки и музыкальная грамота', 'Сл.муз.и муз.гр.', '', '', ''],
            ['Слушание музыки', 'Сл.муз.', '', '', ''],
            ['Современная хореография', 'Совр.хореогр.', '', '', ''],
            ['Современный танец', 'Совр.танец', '', '', ''],
            ['Сольфеджио', 'Сольф.', '', '', ''],
            ['Сочинение и аккомпанемент', 'Соч.акк.', '', '', ''],
            ['Сочинение и композиция', 'Соч.и комп.', '', '', ''],
            ['Струнный ансамбль', 'Стр.анс', '', '', ''],
            ['Сцена', 'Сцена', '', '', ''],
            ['Сценическая речь', 'Сц.речь', '', '', ''],
            ['Сценическое движение', 'Сц.дв.', '', '', ''],
            ['Сценическое мастерство', 'Сц.М', '', '', ''],
            ['Танцевальная практика', 'Танц.практ.', '', '', ''],
            ['Тенор', 'Тенор', '', '', ''],
            ['Теория и история джазовой музыки', 'ТИДМ', '', '', ''],
            ['Теория музыки', 'т/м', '', '', ''],
            ['Тромбон', 'Тром', '', '', ''],
            ['Труба', 'Труб', '', '', ''],
            ['Туба', 'Туба', '', '', ''],
            ['Ударные', 'Удар', '', '', ''],
            ['Флейта', 'Фле', '', '', ''],
            ['Фольклорный ансамбль', 'Ф.анс.', '', '', ''],
            ['Формовка', 'Форм.', '', '', ''],
            ['Формообразование', 'ФО', '', '', ''],
            ['Фортепиано', 'Ф-но', '', '', ''],
            ['Характерный танец', 'Характ.тан.', '', '', ''],
            ['Хор спец.гр.', 'Хор спец.гр.', '', '', ''],
            ['Хор', 'Хор', '', '', ''],
            ['Хоровой класс', 'Хор.класс.', '', '', ''],
            ['Художественная керамика', 'Худ.Кер.', '', '', ''],
            ['Художественное слово', 'Худ.сл.', '', '', ''],
            ['Черчение', 'Черч.', '', '', ''],
            ['Чтение с листа', 'Чт.лист', '', '', ''],
            ['Чтение хоровых партитур', 'Чт.хор.п.', '', '', ''],
            ['Чудеса в ладошках', 'ЧВЛ', '', '', ''],
            ['Шликерное литьё', 'Литьё', '', '', ''],
            ['Электронно-компьютерное музицирование', 'ЭКМ', '', '', ''],
            ['Эстрадно-джазовое пение', 'Эст.дж.пен.', '', '', ''],
            ['Эстрадно-джазовый оркестр', 'Джаз.орк.', '', '', ''],
            ['Эстрадный вокал', 'Эстр.вок', '', '', ''],
            ['Эстрадный танец', 'эстр.тан.', '', '', ''],
            ['Body Ballet', 'Body Ballet', '', '', ''],
            ['"Всезнайки" - класс раннего развития', '"Всезнайки"', '', '', ''],
            ['"Знайки" - класс раннего развития', '"Знайки"', '', '', ''],
            ['"Познайки"- класс раннего развития', '"Познайки"', '', '', ''],
            ['"Почемучки" - класс раннего развития', '"Почемучки"', '', '', ''],
        ];

        foreach ($subject_data as $v) {
            $o = ObjectFactory::create('subject');
            $o->setdata([
                'name' => $v['0'],
                'shortname' => $v['1'],
                'department' => $v['2'],
                'subject_sect' => $v['3'],
                'subject_form' => $v['4'],
            ]);
        }
    }

    /**
     * {@inheritdoc}
     * @throws \yii\db\Exception
     */
    public function safeDown()
    {
        $s = new obj_search_Subject();
        $list = $s->do_search($total);
        foreach ($list as $id) {
            ObjectFactory::subject($id)->delete();
        }

        $s = new obj_search_Employees();
        $list = $s->do_search($total);
        foreach ($list as $id) {
            ObjectFactory::employees($id)->delete();
        }
    }

}
